read_slang --top top -DSYNTHESIS -DSYMBIOSIS -F slang.scr -I $LOWRISC_SAIL_SRC/lib/sv/ --single-unit
scc -select; simplemap; select -clear # slow!
memory_nordff
async2sync
chformal -assume -early
opt_clean
formalff -setundef -clk2ff -ff2anyinit -hierarchy
chformal -live -fair -cover -remove
opt_clean
check
setundef -undriven -anyseq
opt -fast
rename -witness
opt_clean
write_rtlil build/preprocessed.il
